Revit 2026 API

# SymbolGeometryId Methods

---

The SymbolGeometryId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AsUniqueIdentifier | Returns a string suitable to determine if two instances point to the same piece of geometry managed by the same symbol element. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

SymbolGeometryId Class

Autodesk.Revit.DB Namespace